Tekla.Structures.Model.BendSurface.#ctor(Tekla.Structures.Geometry3d.Arc,System.Double,System.Double)
Instantiates a bend surface from a base arc, a height and a radius at the top. This is the recommended
constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
baseArc: Arc to form the base of the bend surface
height: Height of the surface measured along the normal of the arc, may be positive or
negative, but always nonzero
radiusAtHeight: Radius of the arc located at the given height. Must be positive
Throws System.ArgumentException: Thrown if the given lengths are invalid

Tekla.Structures.Model.BendSurface.#ctor(System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.Vector)
Instantiates a bend surface from the cone lateral boundaries and the center line. This is the
recommended constructor if fine grained control is desired over the lateral boundaries of the surface

Tekla.Structures.Model.BendSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Instantiates a bend surface with given parameters. The boundaries are defined by the side boundaries
(i.e. generator lines of the surface).
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1: The first end face normal.
endFaceNormal2: The second end face normal.
sideBoundary1: The first side boundary.
sideBoundary2: The second side boundary.
Throws System.ArgumentNullException: Throws exception if one of the arguments has null value.

Tekla.Structures.Model.BendSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Instantiates a bend surface with given parameters. The boundaries are defined by the lateral
boundaries (i.e. the points on the sides of the curved part of the surface). The side boundaries are
defined by the two first points and the two last points of the lateral boundaries.
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1:  The first end face normal.
endFaceNormal2:  The second end face normal.
lateralBoundary1:  The first lateral boundary
lateralBoundary2:  The second lateral boundary
Throws System.ArgumentNullException:  Throws an exception if one of the arguments is null.
Throws System.ArgumentException:  Throws this exception if the boundaries are invalid.

Tekla.Structures.Model.BendSurface.IsConeOrthogonalToIntersection(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Line)
Checks if the conical surface is orthogonal to the intersection line
endFaceNormal1: First end face normal
endFaceNormal2: Second end face normal
intersectionLine: Intersection line of the plates
Returns: True if the cone is orthogonal to the intersection line, false otherwise

Tekla.Structures.Model.BendSurface.CalculateCenterLine(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Calculates the conical surface center line.
endFaceNormal1: First end face normal
endFaceNormal2: Second end face normal
Returns: The conical surface center line.